# 1. Реалізуйте генераторну функцію, яка повертатиме по одному члену геометричної прогресії із зазначеним множником.
# Генератор повинен зупинити свою роботу або після досягнення зазначеного елементу,
# або при передачі команди на завершення.

def geometric_prog(d: int, end_fun, element=1):
    for i in range(end_fun):
        yield element
        element *= d


for i in geometric_prog(3, 100):
    if i > 200000:
        geometric_prog(3, 10).close()
    else:
        print(i)

# 2. Реалізуйте свій аналог генераторної функції range().


def new_range(stop: int, start=1):
    while start is not stop:
        yield start
        start += 1


for i in new_range(10, 2):
    print(i)

# 3. Напишіть функцію-генератор, яка повертатиме прості числа.
# Верхня межа діапазону повинна бути задана параметром цієї функції.
# 4. Напишіть генераторний вираз для заповнення списку.
# Список повинен бути заповнений кубами чисел від 2 до вказаної вами величини.
